# 1
# словари, строки (до/после), сортировка или поиск
# минимума-максимума по сложному ключу,
# текстовый файл на чтение

# 2
# csv -> json (структуры данных, в т.ч. списки и словари),
# опять сортировки

# 3
# про запрос к готовому серверу requests, json-ответ
# (сервер, порт, протокол http://),
# оформляется в виде функции, возвращающей
# нужную структуру данных, опять сортировка(?)

# 4
# про БД, две связанные таблички,
# запрос составной на выборку
# результат в csv

# 5
# flask, использует json-файл, базу данных
# в одной таблицей, по определённоу запросу отдаёт
# json с нужной структурой данных
